# Data Cleaning and Preparation

In [1]:
import pandas as pd
import numpy as np

## 7\.1 Handling Missing Data

NaN: not a number

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7,3))

In [18]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  1.015876       NaN       NaN
1  1.335243       NaN       NaN
2  0.881992       NaN -0.536632
3  1.121898       NaN  0.235394
4  0.791748 -0.669652  1.599240
5  0.921236  1.810087  1.405127
6 -0.031854 -1.059645 -0.035151

In [19]:
df.dropna()

          0         1         2
4  0.791748 -0.669652  1.599240
5  0.921236  1.810087  1.405127
6 -0.031854 -1.059645 -0.035151

In [24]:
df.dropna(thresh=2) #axis=0, per row, at least 2 valid values

          0         1         2
2  0.881992       NaN -0.536632
3  1.121898       NaN  0.235394
4  0.791748 -0.669652  1.599240
5  0.921236  1.810087  1.405127
6 -0.031854 -1.059645 -0.035151

### Filling In Missing Data

In [25]:
df.fillna(0)

          0         1         2
0  1.015876  0.000000  0.000000
1  1.335243  0.000000  0.000000
2  0.881992  0.000000 -0.536632
3  1.121898  0.000000  0.235394
4  0.791748 -0.669652  1.599240
5  0.921236  1.810087  1.405127
6 -0.031854 -1.059645 -0.035151

In [26]:
df.fillna({1:0.5, 2:0}) # fill value of each column

          0         1         2
0  1.015876  0.500000  0.000000
1  1.335243  0.500000  0.000000
2  0.881992  0.500000 -0.536632
3  1.121898  0.500000  0.235394
4  0.791748 -0.669652  1.599240
5  0.921236  1.810087  1.405127
6 -0.031854 -1.059645 -0.035151

In [27]:
df.fillna(0, inplace=True) #modify existing object inplace

In [28]:
df

          0         1         2
0  1.015876  0.000000  0.000000
1  1.335243  0.000000  0.000000
2  0.881992  0.000000 -0.536632
3  1.121898  0.000000  0.235394
4  0.791748 -0.669652  1.599240
5  0.921236  1.810087  1.405127
6 -0.031854 -1.059645 -0.035151

In [29]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0 -1.530473  1.225974  0.856746
1  0.112270  0.708460  1.916723
2  1.027459       NaN -0.192466
3  0.615833       NaN -0.519426
4  0.078187       NaN       NaN
5 -1.414859       NaN       NaN

In [30]:
df.fillna(method='ffill')  #pad / ffill: propagate last valid observation forward to next valid

          0         1         2
0 -1.530473  1.225974  0.856746
1  0.112270  0.708460  1.916723
2  1.027459  0.708460 -0.192466
3  0.615833  0.708460 -0.519426
4  0.078187  0.708460 -0.519426
5 -1.414859  0.708460 -0.519426

In [31]:
df.fillna(method='ffill',limit=2) #number of nan to fill

          0         1         2
0 -1.530473  1.225974  0.856746
1  0.112270  0.708460  1.916723
2  1.027459  0.708460 -0.192466
3  0.615833  0.708460 -0.519426
4  0.078187       NaN -0.519426
5 -1.414859       NaN -0.519426

In [32]:
data = pd.Series([1.,NA, 3.5, NA, 7])
data.fillna(data.mean()) #mean w/o counting missing values

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7\.2 Data Transformation

### Removing Duplicates

In [42]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [44]:
data.duplicated() # returns a boolean Series indicating whether each row has been observed in a previous row or not

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [45]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [46]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1','k2'],keep='last') # keep the last observed value

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [48]:
data = pd.DataFrame({'food':['bacon','pulled pork', 'bacon',
                            'Pastrami','corned beef', 'Bacon',
                            'pastrami','honey ham','nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [50]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [53]:
data = pd.Series([1.,-999.,2.,-999,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [56]:
data.replace([-999,-1000],[np.nan,0]) #different replacement for each value

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data.replace({-999:np.nan,-1000:0}) #different replacement for each value

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [65]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [66]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [68]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [69]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [70]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [71]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [72]:
pd.cut(ages, [18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [73]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [74]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2) #equal-length bins

[(0.55, 0.77], (0.33, 0.55], (0.77, 0.99], (0.55, 0.77], (0.55, 0.77], ..., (0.33, 0.55], (0.33, 0.55], (0.33, 0.55], (0.11, 0.33], (0.11, 0.33]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.33] < (0.33, 0.55] < (0.55, 0.77] < (0.77, 0.99]]

In [76]:
data = np.random.randn(1000)
cats = pd.qcut(data,4)
cats

[(-0.704, -0.0389], (-3.327, -0.704], (-0.0389, 0.641], (-3.327, -0.704], (-0.704, -0.0389], ..., (-0.0389, 0.641], (-0.704, -0.0389], (-0.0389, 0.641], (0.641, 3.592], (0.641, 3.592]]
Length: 1000
Categories (4, interval[float64]): [(-3.327, -0.704] < (-0.704, -0.0389] < (-0.0389, 0.641] < (0.641, 3.592]]

In [77]:
pd.value_counts(cats)

(0.641, 3.592]       250
(-0.0389, 0.641]     250
(-0.704, -0.0389]    250
(-3.327, -0.704]     250
dtype: int64

In [79]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.277, -0.0389], (-3.327, -1.277], (-0.0389, 1.256], (-3.327, -1.277], (-1.277, -0.0389], ..., (-0.0389, 1.256], (-1.277, -0.0389], (-0.0389, 1.256], (-0.0389, 1.256], (-0.0389, 1.256]]
Length: 1000
Categories (4, interval[float64]): [(-3.327, -1.277] < (-1.277, -0.0389] < (-0.0389, 1.256] < (1.256, 3.592]]

### Detecting and Filtering Outliers

In [80]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.062185    -0.022605    -0.003863    -0.011709
std       0.993178     0.990853     1.001139     1.005238
min      -3.858357    -3.448085    -3.805002    -3.412641
25%      -0.721402    -0.694830    -0.690029    -0.648936
50%      -0.066811     0.005170    -0.036783     0.033542
75%       0.591953     0.641239     0.659576     0.665744
max       3.254388     2.910115     3.464142     2.849670

In [81]:
col = data[2]

In [82]:
col[np.abs(col)>3]

80     3.190691
171   -3.805002
212    3.464142
244   -3.448158
549    3.420803
Name: 2, dtype: float64

True

In [84]:
data[(np.abs(data)>3).any(axis=1)] # return whether an elem in True over the axis

            0         1         2         3
80   0.034212  0.321793  3.190691  0.832512
171 -1.883545  0.057852 -3.805002 -1.265426
212  0.856903  1.987877  3.464142 -1.434529
244 -1.133566 -1.127676 -3.448158 -0.131284
271 -0.069513 -3.448085 -0.129752 -1.232797
340 -3.858357  1.496732  0.185527  0.463496
457  3.117238  1.366852  0.031052  0.651560
523 -3.255443  0.312861 -0.675871 -0.812478
542 -3.435965 -0.878308 -0.484230 -0.711465
549 -0.828305  0.026112  3.420803 -1.969587
692  0.547639  0.148014 -0.208603 -3.097054
707  0.053538 -3.157886 -1.637934 -0.252853
876  3.254388  0.053419 -0.835691 -0.498015
897 -3.246869 -0.471398  0.896178  0.090093
946 -1.320427  0.409526  0.538310 -3.412641

#np.sign() #Returns an element-wise indication of the sign of a number.
#returns -1 if x < 0, 0 if x==0, 1 if x > 0, nan for nan inputs.

In [89]:
data[np.abs(data)>3] = np.sign(data)*3 #cap values outside the inter‐ val –3 to 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.060760    -0.021999    -0.003685    -0.011199
std       0.986115     0.988914     0.993487     1.003630
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.721402    -0.694830    -0.690029    -0.648936
50%      -0.066811     0.005170    -0.036783     0.033542
75%       0.591953     0.641239     0.659576     0.665744
max       3.000000     2.910115     3.000000     2.849670

In [93]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0  1.0  1.0  1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0  1.0 -1.0 -1.0

### Permutation and Random Sampling

In [95]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))
sampler = np.random.permutation(5)
sampler

array([0, 3, 2, 1, 4])

In [96]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [97]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [101]:
df.iloc[sampler]

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [102]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [103]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

2   -1
4    4
3    6
2   -1
0    5
0    5
1    7
0    5
2   -1
0    5
dtype: int64

### Computing Indicator/Dummy Variables

In [104]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [105]:
dummies = pd.get_dummies(df['key'],prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [106]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [107]:
mnames = ['movie_id','title','genres']
movies = pd.read_table('datasets/movielens/movies.dat',sep='::',
                      header=None, names=mnames)
movies[:10]

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [108]:
movies.shape

(3883, 3)

In [ ]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split())